## Getting and Knowing your Data

R에 익숙해져 파이썬을 잊은 나를 위한 자율학습


출처: https://github.com/guipsamora/pandas_exercises

### 1. chipotle(따라하기)

In [1]:
import pandas as pd
import numpy as np

In [2]:
url = 'https://raw.githubusercontent.com/justmarkham/DAT8/master/data/chipotle.tsv'
    
chipo = pd.read_csv(url, sep = '\t')

In [4]:
chipo.head(10)

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,1,Izze,[Clementine],$3.39
2,1,1,Nantucket Nectar,[Apple],$3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98
5,3,1,Chicken Bowl,"[Fresh Tomato Salsa (Mild), [Rice, Cheese, Sou...",$10.98
6,3,1,Side of Chips,NaN,$1.69
7,4,1,Steak Burrito,"[Tomatillo Red Chili Salsa, [Fajita Vegetables...",$11.75
8,4,1,Steak Soft Tacos,"[Tomatillo Green Chili Salsa, [Pinto Beans, Ch...",$9.25
9,5,1,Steak Burrito,"[Fresh Tomato Salsa, [Rice, Black Beans, Pinto...",$9.25

In [11]:
print(chipo.shape)

(4622, 5)

In [10]:
chipo.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4622 entries, 0 to 4621
Data columns (total 5 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   order_id            4622 non-null   int64
 1   quantity            4622 non-null   int64
 2   item_name           4622 non-null   object
 3   choice_description  3376 non-null   object
 4   item_price          4622 non-null   object
dtypes: int64(2), object(3)
memory usage: 180.7+ KB

In [12]:
chipo.columns

Index(['order_id', 'quantity', 'item_name', 'choice_description',
       'item_price'],
      dtype='object')

In [13]:
chipo.index

RangeIndex(start=0, stop=4622, step=1)

In [20]:
# Which was the most-ordered item?
mostchipo= chipo.groupby('item_name').sum().sort_values(['quantity'], ascending=False)
# 아이템 이름으로 그룹바이해서 퀀티티 합치고, 양으로 value 내림차순 정렬

In [24]:
mostchipo.head(1)

              order_id  quantity
item_name
Chicken Bowl    713926       761

In [25]:
#What was the most ordered item in the choice_description column?
chipo.groupby('choice_description').sum().sort_values(['quantity'], ascending=False).head(1)

                    order_id  quantity
choice_description
[Diet Coke]           123455       159

In [26]:
chipo.quantity.sum()

4972

In [27]:
# Turn the item price into a float

In [28]:
chipo.item_price.dtype

dtype('O')

- lambda 함수

  함수를 생성할 때 사용하는 예약어로, def와 동일한 역할인데 보통 함수를 한 줄로 간결하게 만들때 사용함. 
  
  return 명령어 없어도 결과값을 돌려줌.
  
  lambda 매개변수1, 매개변수2, ... : 매개변수를 사용한 표현식

In [30]:
# Create a lambda function and change the type of item price
dollarizer = lambda x: float(x[1:-1]) # 처음부터 끝까지 float로 만들어줘라는거야?
chipo.item_price = chipo.item_price.apply(dollarizer)

In [34]:
chipo.item_price #chipo.item_price.dtype

0        2.39
1        3.39
2        3.39
3        2.39
4       16.98
        ...
4617    11.75
4618    11.75
4619    11.25
4620     8.75
4621     8.75
Name: item_price, Length: 4622, dtype: float64

In [42]:
# How much was the revenue for the period in the dataset?
revenue = (chipo['quantity']* chipo['item_price']).sum()

print('Revenue was: $' + str(np.round(revenue,2)))

Revenue was: $39237.02

In [43]:
# How many orders were made in the period?
orders = chipo.order_id.value_counts().count()
orders

1834

In [45]:
# What is the average revenue amount per order?
# Solution 1
chipo['revenue'] = chipo['quantity'] * chipo['item_price']
order_grouped = chipo.groupby(by=['order_id']).sum()
order_grouped.mean()['revenue']

21.394231188658654

In [46]:
chipo.item_name.value_counts().count()

50

### 2. Occupation(문제풀기)

In [ ]:
# Step 1. Import the necessary libraries

In [1]:
import pandas as pd
import numpy as np

In [4]:
# Step 2. Import the dataset from this address.
url = 'https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user'
    
occu = pd.read_csv(url, sep = '|')

In [13]:
occu.head(5)

         age gender  occupation zip_code
user_id
1         24      M  technician    85711
2         53      F       other    94043
3         23      M      writer    32067
4         24      M  technician    43537
5         33      F       other    15213

In [8]:
# Step 3. Assign it to a variable called users and use the 'user_id' as index
occu= occu.set_index('user_id')

In [9]:
# Step 4. See the first 25 entries
occu.head(25)

         age gender     occupation zip_code
user_id
1         24      M     technician    85711
2         53      F          other    94043
3         23      M         writer    32067
4         24      M     technician    43537
5         33      F          other    15213
6         42      M      executive    98101
7         57      M  administrator    91344
8         36      M  administrator    05201
9         29      M        student    01002
10        53      M         lawyer    90703
11        39      F          other    30329
12        28      F          other    06405
13        47      M       educator    29206
14        45      M      scientist    55106
15        49      F       educator    97301
16        21      M  entertainment    10309
17        30      M     programmer    06355
18        35      F          other    37212
19        40      M      librarian    02138
20        42      F      homemaker    95660
21        26      M         writer    30068
22        25      M         writer    40206
23        30      F         artist    48197
24        21      F         artist    94533
25        39      M       engineer    55107

In [10]:
# Step 5. See the last 10 entries
occu.tail(10)

         age gender     occupation zip_code
user_id
934       61      M       engineer    22902
935       42      M         doctor    66221
936       24      M          other    32789
937       48      M       educator    98072
938       38      F     technician    55038
939       26      F        student    33319
940       32      M  administrator    02215
941       20      M        student    97229
942       48      F      librarian    78209
943       22      M        student    77841

In [12]:
# Step 6. What is the number of observations in the dataset?
# Step 7. What is the number of columns in the dataset?
occu.shape

(943, 4)

In [14]:
# Step 8. Print the name of all the columns.
occu.columns

Index(['age', 'gender', 'occupation', 'zip_code'], dtype='object')

In [15]:
# Step 9. How is the dataset indexed?
occu.index

Int64Index([  1,   2,   3,   4,   5,   6,   7,   8,   9,  10,
            ...
            934, 935, 936, 937, 938, 939, 940, 941, 942, 943],
           dtype='int64', name='user_id', length=943)

In [18]:
# Step 10. What is the data type of each column?
occu.info()
 # or 
# occu.dtypes

<class 'pandas.core.frame.DataFrame'>
Int64Index: 943 entries, 1 to 943
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   age         943 non-null    int64
 1   gender      943 non-null    object
 2   occupation  943 non-null    object
 3   zip_code    943 non-null    object
dtypes: int64(1), object(3)
memory usage: 36.8+ KB

In [19]:
# Step 11. Print only the occupation column
occu.occupation

user_id
1         technician
2              other
3             writer
4         technician
5              other
           ...
939          student
940    administrator
941          student
942        librarian
943          student
Name: occupation, Length: 943, dtype: object

In [21]:
# Step 12. How many different occupations are in this dataset?
len(set(occu.occupation))
# occu.occupation.nunique()

21

In [22]:
set(occu.occupation) # set은 중복을 허용하지 않는 자료형

{'administrator',
 'artist',
 'doctor',
 'educator',
 'engineer',
 'entertainment',
 'executive',
 'healthcare',
 'homemaker',
 'lawyer',
 'librarian',
 'marketing',
 'none',
 'other',
 'programmer',
 'retired',
 'salesman',
 'scientist',
 'student',
 'technician',
 'writer'}

In [24]:
# Step 13. What is the most frequent occupation?
occu.groupby('occupation').count().sort_values(['age'], ascending=False).head(1)
# or 
# occu.occupation.value_counts().head(1).index[0]
# occu.occupation.value_counts().head()

            age  gender  zip_code
occupation
student     196     196       196

In [30]:
# Step 14. Summarize the DataFrame.
occu.describe()

              age
count  943.000000
mean    34.051962
std     12.192740
min      7.000000
25%     25.000000
50%     31.000000
75%     43.000000
max     73.000000

In [37]:
occu.columns

Index(['age', 'gender', 'occupation', 'zip_code'], dtype='object')

In [44]:
# Step 15. Summarize all the columns
for i in occu.columns:
   print(occu[i].describe())
   print('______________')

count    943.000000
mean      34.051962
std       12.192740
min        7.000000
25%       25.000000
50%       31.000000
75%       43.000000
max       73.000000
Name: age, dtype: float64
______________
count     943
unique      2
top         M
freq      670
Name: gender, dtype: object
______________
count         943
unique         21
top       student
freq          196
Name: occupation, dtype: object
______________
count       943
unique      795
top       55414
freq          9
Name: zip_code, dtype: object
______________

In [56]:
# 솔루션은 좀 달랐듬... 포문 괜히 씀ㅎㅎ
occu.describe(include = "all") #Notice: By default, only the numeric columns are returned.

               age gender occupation zip_code
count   943.000000    943        943      943
unique         NaN      2         21      795
top            NaN      M    student    55414
freq           NaN    670        196        9
mean     34.051962    NaN        NaN      NaN
std      12.192740    NaN        NaN      NaN
min       7.000000    NaN        NaN      NaN
25%      25.000000    NaN        NaN      NaN
50%      31.000000    NaN        NaN      NaN
75%      43.000000    NaN        NaN      NaN
max      73.000000    NaN        NaN      NaN

In [34]:
# Step 16. Summarize only the occupation column
occu.occupation.describe()

count         943
unique         21
top       student
freq          196
Name: occupation, dtype: object

In [50]:
# Step 17. What is the mean age of users?
occu['age'].mean()

34.05196182396607

In [54]:
# Step 18. What is the age with least occurrence?
occu.occupation.count()

943

In [57]:
# Step 18. What is the age with least occurrence?
occu.groupby('age').count().sort_values(['occupation'], ascending=True).head(5)

     gender  occupation  zip_code
age
7         1           1         1
66        1           1         1
73        1           1         1
10        1           1         1
11        1           1         1

In [58]:
# 솔류션은 좀 달랐음
occu.age.value_counts().tail() #7, 10, 11, 66 and 73 years -> only 1 occurrence

11    1
10    1
73    1
66    1
7     1
Name: age, dtype: int64